loadtest.yml
config:
  target: "https://reliance-matrix.onrender.com"
  phases:
    # Ramp up: 10 users per second for 20 seconds = 200 users
    - duration: 20
      arrivalRate: 10
      name: "Ramp up to 200 users"
    # Hold: keep connections alive while quiz runs
    - duration: 600
      arrivalRate: 0
      name: "Hold connections during quiz"
  engines:
    socketio-v3:
      transports: ["websocket"]
  socketio-v3:
    query:
      EIO: "4"

scenarios:
  - name: "Quiz participant"
    engine: socketio-v3
    flow:
      # Join the quiz
      - emit:
          channel: "participant:join"
          data:
            name: "LoadTest_{{ $randomNumber(1000,9999) }}"

      # Wait for quiz to start (host starts manually)
      - think: 10

      # Round 1 - 10 questions (variable timers: 12-60s)
      # Q1 - 12s timer
      - think: "{{ $randomNumber(2,10) }}"
      - emit:
          channel: "participant:answer"
          data:
            answer: "B"
            questionIndex: 0
      - think: 15

      # Q2 - 15s timer
      - think: "{{ $randomNumber(2,12) }}"
      - emit:
          channel: "participant:answer"
          data:
            answer: "C"
            questionIndex: 1
      - think: 15

      # Q3 - 20s timer
      - think: "{{ $randomNumber(2,15) }}"
      - emit:
          channel: "participant:answer"
          data:
            answer: "A"
            questionIndex: 2
      - think: 15

      # Q4 - 25s timer
      - think: "{{ $randomNumber(2,20) }}"
      - emit:
          channel: "participant:answer"
          data:
            answer: "D"
            questionIndex: 3
      - think: 15

      # Q5 - 25s timer
      - think: "{{ $randomNumber(2,20) }}"
      - emit:
          channel: "participant:answer"
          data:
            answer: "B"
            questionIndex: 4
      - think: 15

      # Q6 - 30s timer
      - think: "{{ $randomNumber(2,25) }}"
      - emit:
          channel: "participant:answer"
          data:
            answer: "A"
            questionIndex: 5
      - think: 15

      # Q7 - 30s timer
      - think: "{{ $randomNumber(2,25) }}"
      - emit:
          channel: "participant:answer"
          data:
            answer: "C"
            questionIndex: 6
      - think: 15

      # Q8 - 45s timer
      - think: "{{ $randomNumber(2,35) }}"
      - emit:
          channel: "participant:answer"
          data:
            answer: "B"
            questionIndex: 7
      - think: 15

      # Q9 - 35s timer
      - think: "{{ $randomNumber(2,30) }}"
      - emit:
          channel: "participant:answer"
          data:
            answer: "D"
            questionIndex: 8
      - think: 15

      # Q10 - 60s timer
      - think: "{{ $randomNumber(2,50) }}"
      - emit:
          channel: "participant:answer"
          data:
            answer: "A"
            questionIndex: 9
      - think: 20

      # Round 2 - 10 questions (mostly 20-35s timers)
      - think: "{{ $randomNumber(2,15) }}"
      - emit:
          channel: "participant:answer"
          data:
            answer: "C"
            questionIndex: 10
      - think: 15

      - think: "{{ $randomNumber(2,15) }}"
      - emit:
          channel: "participant:answer"
          data:
            answer: "A"
            questionIndex: 11
      - think: 15

      - think: "{{ $randomNumber(2,15) }}"
      - emit:
          channel: "participant:answer"
          data:
            answer: "B"
            questionIndex: 12
      - think: 15

      - think: "{{ $randomNumber(2,15) }}"
      - emit:
          channel: "participant:answer"
          data:
            answer: "D"
            questionIndex: 13
      - think: 15

      - think: "{{ $randomNumber(2,15) }}"
      - emit:
          channel: "participant:answer"
          data:
            answer: "A"
            questionIndex: 14
      - think: 15

      - think: "{{ $randomNumber(2,20) }}"
      - emit:
          channel: "participant:answer"
          data:
            answer: "C"
            questionIndex: 15
      - think: 15

      - think: "{{ $randomNumber(2,20) }}"
      - emit:
          channel: "participant:answer"
          data:
            answer: "B"
            questionIndex: 16
      - think: 15

      - think: "{{ $randomNumber(2,25) }}"
      - emit:
          channel: "participant:answer"
          data:
            answer: "A"
            questionIndex: 17
      - think: 15

      - think: "{{ $randomNumber(2,30) }}"
      - emit:
          channel: "participant:answer"
          data:
            answer: "D"
            questionIndex: 18
      - think: 15

      - think: "{{ $randomNumber(2,20) }}"
      - emit:
          channel: "participant:answer"
          data:
            answer: "B"
            questionIndex: 19
      - think: 20

      # Round 3 - 10 questions (20-45s timers)
      - think: "{{ $randomNumber(2,15) }}"
      - emit:
          channel: "participant:answer"
          data:
            answer: "C"
            questionIndex: 20
      - think: 15

      - think: "{{ $randomNumber(2,15) }}"
      - emit:
          channel: "participant:answer"
          data:
            answer: "A"
            questionIndex: 21
      - think: 15

      - think: "{{ $randomNumber(2,20) }}"
      - emit:
          channel: "participant:answer"
          data:
            answer: "D"
            questionIndex: 22
      - think: 15

      - think: "{{ $randomNumber(2,20) }}"
      - emit:
          channel: "participant:answer"
          data:
            answer: "B"
            questionIndex: 23
      - think: 15

      - think: "{{ $randomNumber(2,20) }}"
      - emit:
          channel: "participant:answer"
          data:
            answer: "A"
            questionIndex: 24
      - think: 15

      - think: "{{ $randomNumber(2,20) }}"
      - emit:
          channel: "participant:answer"
          data:
            answer: "C"
            questionIndex: 25
      - think: 15

      - think: "{{ $randomNumber(2,20) }}"
      - emit:
          channel: "participant:answer"
          data:
            answer: "D"
            questionIndex: 26
      - think: 15

      - think: "{{ $randomNumber(2,20) }}"
      - emit:
          channel: "participant:answer"
          data:
            answer: "B"
            questionIndex: 27
      - think: 15

      - think: "{{ $randomNumber(2,35) }}"
      - emit:
          channel: "participant:answer"
          data:
            answer: "A"
            questionIndex: 28
      - think: 15

      - think: "{{ $randomNumber(2,20) }}"
      - emit:
          channel: "participant:answer"
          data:
            answer: "C"
            questionIndex: 29
      - think: 30